// -რა არის node, რისთვის გვჭირდება.

// node არის JavaScript-ის გამშვები გარემო, რომელიც კოდის გაშვების საშუალებას არამხოლოდ ბრაუზერში, არამედ სერვერებზეც გვაძლევს.

// -რა არის package.json ფაილი და რა ინფორმაციას ინახავს იგი.

// package.json არის ფაილი, რომელიც პროექტის შესახებ არსებულ მნიშვნელოვან ინფორმაციას ინახავს. ამ ფაილში ინფორმაცია json-ის ფორმატშია შენახული. მაგ: name, version, description, main, scripts (npm start, npm run build, etc.), author, license, type, dependencies


// - ახსენით რა package დააყენეთ, რას აკეთებს და რისთვის/რაში გამოიყენება.

// lodash. --> lodash საშუალებას გვაძლევს მივწვდეთ ისეთ მეთოდებსა და ფუნქციებს, რემლებსაც JavaScript-ში ვერ შევხვდებით.