// 1) რა არის state React ში და რითი განსხვავდება იგი props გან?

// React-ში state არი სკომპონენტის რომელიმე ელემენტის მდგომარეობა. props-ისგან იმით განსხვავდება, რომ მას ორი არგუმეტი გადაეცემა:
// • ელემენტი მდგომარეობა, რომლის მდგომარეობა უნდა შევცვალოთ. (state)
// • ფუნქცია, რომლის საშუალებითაც ვცვლით სასურველი ელემენტის მდგომარეობას. (stateChanger)

// 2)  რა არის useState? რატომ ვიყენებთ/ რა პრობლემას აგვარებს?

// useState არის React-ის Hook, რომლის საშუალებითაც ვცვლით ელემენტის მდგომარეობას. 
// useState-ს გამოყენების გარეშე პირდაპირ არ იყო ელემენტის დგომარეობის შეცვლა შესაძლებელი.

// 3) რას აბრუნებს useState ფუნქცია?

//  useState ფუნქცია აბრუნებს სიას.

// 4) რატომ არ უნდა შევცვალოთ state პირდაპირ? (მაგ. count++)

// 5) რა ემართება კომპონენტს, როცა state იცვლება?

// როდესაც state-ს ვცვლით, კომპონენტი საიტზე თავიდან რენდერდება.
